<?php

return [
    /**
     * 系统错误1000-1099
     */
    1000 => '系统错误',
    1001 => '参数错误',
    1002 => '参数不能为空',
    1003 => '权限不足',
    1004 => '操作失败',
    1005 => '操作成功',
    1006 => '信息获取失败',
    1007 => '文件写入失败',
    1008 => '数据加载出错，请检查模板中的模型名称是否正确',
    /**
     * 手机号错误 1100-1199
     */
    1100 => '手机号格式错误',
    1101 => '手机号已经注册',
    1102 => '手机号不存在',
    1103 => '现在是测试阶段，如果需要测试请联系管理员',
    1104 => '请输入手机号11位数字',
    1105 => '手机号可以注册',
    /**
     * 用户错误1200-1299
     */
    1200 => '用户名或密码错误',
    1201 => '操作员登录状态已锁定，请联系管理员',
    1202 => '用户名不存在',
    1203 => '用户名已存在',
    1204 => '请输入用户名',
    1205 => '请输入手机号/邮箱/用户名',
    1206 => '账号或密码错误',
    1207 => '账号不存在',
    1208 => '用户状态已锁定',
    /**
     * 密码错误1300-1399
     */
    1300 => '请输入密码6-20位字符',
    1301 => '密码不能为空',
    1302 => '请确保两次密码输入一致',
    1303 => '请输入原密码6-20位字符',
    1304 => '不修改密码请留空',
    1305 => '原密码验证失败',
    /**
     * 真实姓名1400-1499
     */
    1400 => '请输入真实姓名2-4位字符',
    /**
     * 邮箱1500-1599
     */
    1500 => '请正确输入邮箱',
    1501 => '邮箱已存在',
    1502 => '邮箱不存在',
    /**
     * 验证码错误 1600-1699
     */
    1600 => '请输入4位验证码',
    1601 => '验证码不能为空',
    1602 => '验证码错误',
    1603 => '验证码正确',
    /**
     * 文章验证 1700-1799
     */
    1700 => '请输入名称2-255位字符',
    /**
     * 角色验证 1800-1899
     */
    1800 => '请选择角色',
    /**
     * URL验证 1900-1999
     */
    1900 => '请输入菜单连接3-50位字符',
    1901 => '菜单连接已存在',
    /**
     * 客户验证 2000-2001
     */
    2000 => '请输入客户姓名2-4位汉字',
    2001 => '客户姓名已存在',
    /**
     * 邮箱 2100-2199
     */
    2100 => '邮箱校验码发送失败',
    2101 => '邮箱校验码发送成功',
    2102 => '邮箱校验码错误',
    2103 => '邮箱校验码正确',
    2104 => '邮箱校验码已过期，请重新获取',
    2105 => '邮箱校验码发送频率过快，请1分钟后发送',
    2106 => '邮箱校验码发送次数过多',
    2107 => '当前IP邮箱校验码发送次数过多',
    2108 => '邮箱校验码模板不存在',
    /**
     * 短信 2200-2299
     */
    2200 => '短信验证码发送失败',
    2201 => '短信验证码发送成功',
    2202 => '短信验证码验证失败',
    2203 => '短信验证码验证成功',
    2204 => '短信验证码已过期，请重新获取',
    2205 => '短信验证码发送频率过快，请1分钟后发送',
    2206 => '短信验证码发送次数过多',
    2207 => '当前IP短信验证码发送次数过多',
    2208 => '短信模板不存在',
    /**
     * 公共验证 2000-2099
     */
    9000 => '名称已存在',
    9001 => '请输入名称2-50位字符',
    9003 => '请输入名称2-255位字符',
    9004 => '请输入名称2-60位字符',
    9005 => '不可以选择自己为父级菜单',
    9006 => '不可以选择自己子类为父级菜单',
    9007 => '该数组有重复值',
    9008 => '请先删除本条记录的子类后再删除',
];
